# একটি কন্ডীশীনের ভেতরে দুইটা ডেটা সমান কিনা তা চেক করার জন্যে == ব্যবহার করা হয়।
print(10==10)
# একটি কন্ডীশীনের ভেতরে দুইটা ডেটা সমান নয় কিনা,তা চেক করার জন্যে != ব্যবহার করা হয়।
print(10!=10)
# কন্ডিশনের দুইটা ডেটার মধ্যে প্রথম ডেটা টি বড় কিনা তা চেক করার জন্য > সাইন ইউজ করা হয়।
print(9>8)
# কন্ডিশনের দুইটা ডেটার মধ্যে প্রথম ডেটা টি ছোট কিনা তা চেক করার জন্য < সাইন ইউজ করা হয়।
print(8<7)
# কন্ডিশনের দুইটা ডেটার মধ্যে প্রথম ডেটা টি সমান অথবা বড় কিনা তা চেক করার জন্য >= সাইন ইউজ করা হয়।
print(10>=10)
# কন্ডিশনের দুইটা ডেটার মধ্যে প্রথম ডেটা টি সমান কিংবা ছোট কিনা তা চেক করার জন্য => সাইন ইউজ করা হয়।
print(10<=10)