# for লুপ দিয়ে খুব সহজেই যেকোনো সিকোয়েন্স টাইপ অবজেক্ট যেমন list, string ইত্যাদির মধ্যে iterate করা যায়। তাহলে দেখি উপরের প্রোগ্রামটি কিভাবে ফর লুপ ব্যবহার করে করা সম্ভব,

items = ["pant","jama","money bnag","ghori"]

for item in items:
    print(item)


# এখন ধরুন আপনার কাছে কোন লিস্ট নাই কিন্তু নির্দিষ্ট সংখ্যকবার একটি কাজ পুনরাবৃত্তি করা দরকার। তখন কি করব? এ জন্য একটি সুন্দর ফাংশন হতে পারে range
for i in range(9):
    print(i)
# আমাদের রেঞ্জ পছন্দমত বলে দিতে পারি, যেমন ধরুন, 9 থেকে শুরু করে 18 পর্যন্ত। এজন্য আমাদের যা করতে হবে , রেঞ্জ ফাংশনে দুইটা মান বা প্যারামিটার পাস করতে হবে, প্রথমটা শুরু এবং পরেরটা শেষের মান। নিচের কোডটা খেয়াল করি
for i in range(9,18):
    print(i)
# আমরা স্টেপ সাইজও বলে দিতে পারি এখানে। মানে, কত ঘর পরপর মান বা ভ্যালু প্রিন্ট করবে সেটা। এরজন্য আমাদের উপরের মানদুটির সাথে আরো একটি প্যারামিটার দিতে হবে, যেটা হবে ইন্টারভাল বা স্টেপ সাইজ। যেমন ধরুন, আমরা 9 থেকে 18 পর্যন্ত প্রিন্ট করবো এবং চাই যে তিন ঘর পরপর প্রিন্ট হোক। তাহলে এর জন্য আমাদের রেঞ্জ ফাংশনের ভিতরে যথাক্রামে, 'শুরু, শেষ, স্টেপ_সাইজ' মানগুলো বসাতে হবে।
for i in range(9,18,3):
    print(i)
# এবার রেঞ্জ ব্যবহার করে এমন একটি কোড লিখি যেটা উল্টো দিকে ভ্যালু প্রিন্ট করবে, মানে ধরুন ১০ থেকে শুরুে হয়ে ০ পর্যন্ত যাবে এবং চলুন এর সাথে স্টেপ সাইজও ব্যবহার করে ফেলি, যেনো দুই ঘর পিছিয়ে পিছিয়ে ভ্যালু প্রিন্ট করে
for i in range(10, 0, -2):
    print(i)